#+title:  Chapter 7
#+author: Reinhard Stahn
#+setupfile: ./inc/setupfile.org
#+include: ./inc/latex-macros.org
#+property: header-args:sage :session *sage-chapter-7* :tangle chapter_7.sage
#+property: header-args:python :session *py-chapter-7* :tangle chapter_7.py

#+toc: headlines 2

** Harmonic Oscillator
To simplify calculations we will use unit-less expressions. To do this let $\tilde{x}$,
$\tilde{p}$, etc denote physical quantities /with/ units and denote the unit-less versions
without the tilde, such that e.g.

<<unitless-position-and-momentum>>
$$
  \tilde{x} = \sqrt{\frac{\hbar}{m\omega}} \; x, \quad \tilde{p} = \sqrt{m\omega\hbar} \; p .
$$

Note that this implies $p=-\ii\partial_x$. The effect on $H$ and $a$ is the same as
setting $m=\hbar=\omega=1$ (we have e.g. $H=p^2/2+x^2/2$).

In this chapter let us use the python based computer algebra system [[https://www.sagemath.org/][sage]] to solve the
exercises (some of them). For this reason we define momentum and position operator in code
as follows:

#+name: position-momentum-operator
#+begin_src sage
  R.<x> = QQbar[]
  W = DifferentialWeylAlgebra(R)
  (x, dx) = W.gens()
  p = -i*dx
#+end_src

Having this we can define the Hamiltonian $H$ of the one-dimensional harmonic oscillator
and the corresponding annihilation ($a$), and creation operator ($a^\dagger$):

#+name: commutator-ladder-operators
#+begin_src sage
  H_qho = p^2 / 2 + x^2 / 2

  a = (x + i*p) / sqrt(2)
  ad = (x - i*p) / sqrt(2)
#+end_src

Some basic sanity checks:

#+name: commutator-ladder-operators-checks
#+begin_src sage :results replace :tangle no :cache yes
  assert com(x, p) == i
  assert com(a, ad) == 1
  "PASSED"
#+end_src

#+RESULTS[7274798eb8e917891bbfa50d7dfa80ec1b7a9b47]: commutator-ladder-operators-checks
: 'PASSED'

Note that from [[unitless-position-and-momentum][above]] we get

<<unitless-hamiltonian-and-annihilator>>
$$
  \tilde{H} = \hbar\omega H, \quad \tilde{a} = a .
$$

For convenience let us also define the number operator $N=a^\dagger a = H-1/2$. Clearly
the number operator has the same eigenstates as $H$. The corresponding eigenvalues are
shifted by $1/2$.

<<spectrum-harmonic-oscillator-1d>>
- Theorem (Spectrum of 1D Harmonic Oscillator) :: Let

  $$ \ket{0} = \frac{1}{\sqrt{2\pi}} e^{-x^2 / 2} , $$

  and

  $$ \ket{n} = \frac{(a^\dagger)^n}{\sqrt{n!}} \ket{0} , $$

  for $n\in\{1,2,\ldots\}$. These states form an orthonormal set of the Hilbert space
  $L^2 (\RR)$ of square integrable functions. Moreover they are eigenstates of $H$ and $N$
  with $N\ket{n}=n\ket{n}$.
  - Remark :: <<gaussian-integral>> It is well known that the gaussian function which
    defines $\ket{0}$ is already normalized (see [[https://en.wikipedia.org/wiki/Gaussian_integral][gaussian integral]]).
  - Proof :: See [[#exercise-7.4-proof][solution of exercise 7.4]].

*** Solution
This is just boring algebra which can be done much faster (and more reliably) by /sage/:

#+name: exercise-7.1
#+begin_src sage :results replace :tangle no :cache yes
  assert ad * a == H_qho - 1/2
  "PASSED"
#+end_src

#+RESULTS[38f2058bc713985fbab62335c0887638d917a285]: exercise-7.1
: 'PASSED'

*** Solution
The unitless result is $1$:

#+name: exercise-7.2
#+begin_src sage :results replace :tangle no :cache yes
  com(a, ad)
#+end_src

#+RESULTS[78c440463e894f8531e28cce10a7a932478e9b08]: exercise-7.2
: 1

Since the [[unitless-hamiltonian-and-annihilator][creator/annihilator is already unit-less]] the same is true with units.

*** Solution
Assuming evolution from left to right the circuit implements $ZB_{\theta=\pi/4}$ (note
that the phase shift is $Z$ up to a global phase). Below you can see that then the
assertion of the exercise is wrong. We give two alternatives instead.

#+begin_src sage :results replace :tangle no :cache yes
  B0 = B.subs(theta=pi/4)
  B1 = B.subs(theta=-pi/4)

  # This shows that the original circuit does not implement H, not even if we neglect a
  # global phase
  f"sqrt(2)*H != {sqrt(2) * Z * B0}"

  # These alternatives implement the Hadamard gate:
  assert B0 * Z == H
  assert Z * B1 == H
  "PASSED"
#+end_src

#+RESULTS[04d7c5cbd0a5ca296a6d967664b6e4facfdcd1d6]:
: 'sqrt(2)*H != [ 1 -1]\n[-1 -1]'
: 'PASSED'

*** Solution
Recall that we have $B=B(\theta)=R_y(2\theta)$. Hence $B_{\theta=\pi/4}$ is a rotation
around the y-axis by ninety degrees. This maps the x-axis onto the reversed z-axsis. Hence
the (reversed) z-rotation in the middle effectively acts like a rotation around the x-axis
by an angle $+\varphi$. The net result is $R_x(\varphi)$.

Such reasoning easily leads to subtle errors. Therefore let us verify this using sagemath:

#+begin_src sage :results replace :tangle no :cache yes
  B0 = B.subs(theta=pi/4)
  phi = SR.var('phi', domain='real')

  assert B0.H * Rz.subs(theta=-phi) * B0 == Rx.subs(theta=phi)
  "PASSED"
#+end_src

#+RESULTS[d181afcb2e3cccc86669ae1b88ef476fc645b9a9]:
: 'PASSED'

It worked out 😎!

